In [4]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np

In [5]:
def extract():
    data = pd.read_csv("test.csv")
    return data

In [6]:
def transform(data:dict)->pd.DataFrame:
    df = pd.DataFrame(data)
    print(f"There are {len(df)} loan entries in this data set")
    # I want to single out the loans of people who have graduated,are not self-employed, and co-app. income is 0
    df = df[df["Education"] == "Graduate"]
    df = df[df["Self_Employed"] == "No"]
    df = df[df["CoapplicantIncome"] == 0]
    # I want to only return the columns: loan amount, loan term, and loan id
    return df[["Loan_ID","LoanAmount","Loan_Amount_Term"]]

In [13]:
def load(df) -> pd.DataFrame:
    db_path = '/Users/colegauerkemacbook/Desktop/ETL/database/loan.db'
    engine = create_engine(f'sqlite:///{db_path}')
    df.to_sql('loan_approval_data',con=engine,if_exists='replace',index=False)
    df_from_db = pd.read_sql("SELECT * FROM loan_approval_data",engine)
    print(df_from_db.head())
    return df_from_db

In [14]:
data = extract()
df = transform(data)
print(f"There are {len(df)} entries")
load(df)

There are 367 loan entries in this data set
There are 101 entries
    Loan_ID  LoanAmount  Loan_Amount_Term
0  LP001015       110.0             360.0
1  LP001083        40.0             180.0
2  LP001096       124.0             360.0
3  LP001099       131.0             360.0
4  LP001128       101.0             360.0

      Loan_ID  LoanAmount  Loan_Amount_Term
0    LP001015       110.0             360.0
1    LP001083        40.0             180.0
2    LP001096       124.0             360.0
3    LP001099       131.0             360.0
4    LP001128       101.0             360.0
..        ...         ...               ...
96   LP002870        80.0             360.0
97   LP002876       176.0             360.0
98   LP002878       260.0             360.0
99   LP002899       254.0             360.0
100  LP002952        60.0             360.0

[101 rows x 3 columns]